ايه هو ال  Facade؟

الـ Facade هو Design Pattern من نوع Structural، فكرته الأساسية إنه بيوفرلك واجهة بسيطة وموحدة لمجموعة من الـ Classes أو الـ Subsystems المعقدة.
زي ما المبنى من الخارج يبدو بسيط وجميل بس من الداخل فيه كهرباء وسباكة وهيكل معقد — الـ Facade بالظبط كده.


  ليه فكروا انهم يعملوه؟ 

  المهندسين كانوا شايفين إن الكود بيكبر والـ Systems بتتعقد، وبقى فيه مشكلة واحدة بس بتتكرر في كل مكان:
اللي محتاج يستخدم النظام مضطر يعرف كل تفاصيله الداخلية عشان يقدر يشتغل.
________________________________________
ده كان بيعمل ثلاث آلام:
١ — الوقت — المطور الجديد بياخد أسابيع يفهم النظام قبل ما يكتب سطر واحد.
*** بحيث يعرف كل حاجه هيتعامل معاها , لانه ملوش حاجه محدده يتعامل معاها او حاجه واحده يتعامل معاها وهي اللي تكون مسئوله عن النظام كله وباقي التعقيد , فهيطر يفهم كل ده 
  
٢ — الهشاشة — أي تغيير صغير جوه النظام بيكسر كل الكود اللي بيستخدمه.
***لان الكود بتاع النظام بيستخدمه بشكل مباشر علشان كده اي تعديل هيأثر في  الكود اللي بيتعامل معاه علشان التعامل هنا مباشر 
  
٣ — التكرار — نفس تسلسل الخطوات بيتكتب في عشرين مكان، ولو في bug هتصلحه في عشرين مكان.
***علشان مافيش واجهة محدده تتعامل مع النظام كله فلو كتبت النظام ده في مكان محدد وعوزته في  مكان تاني , هضطر اعمله من تاني وبالتالي ده كارثه لان اي تعديل برده هيعكسر كل ده , انما لو عندي واجهه بتلم كل الكود بتاع النظام ده وهي اللي بتكون بتتعامل معاه هي واجهة بس ليه , هستخدم الواجهة دي بس في  المكان الي هعوز فيه النظام تاني من غير مااكتب من الاول تاني 


  
