Proxy Design Pattern:
نمط تصميم الوكيل هو نمط تصميم هيكلي حيث يعمل كائن الوكيل كعنصر نائب للتحكم في الوصول إلى الكائن الأصلي. يتواصل العميل مع الوكيل، الذي بدوره يوجه الطلبات إلى الكائن الأصلي. كما يمكن للوكيل توفير وظائف إضافية مثل التحكم في الوصول، والتهيئة المؤجلة، والتسجيل، والتخزين المؤقت.

•	يساعد في إدارة الوصول إلى الكائنات الحساسة أو التي تستهلك موارد كثيرة دون الكشف عن تفاصيلها الداخلية.
•	يحسّن الأداء عن طريق تأخير إنشاء الكائنات من خلال التحميل الكسول.
•	يسمح بإضافة مسؤوليات إضافية (مثل الأمن أو التسجيل) دون تعديل الكائن الحقيقي.


  ببساطة:
Proxy هو كلاس وسيط (وسيط ذكي) بيقف بينك وبين الكائن الحقيقي (Real Object) علشان يتحكم في الوصول ليه.
يعني بدل ما تتعامل مباشرة مع object تقيل أو حساس، بتتعامل مع Proxy.


  
